# === Taps ===
tap "homebrew/bundle"
tap "homebrew/services"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "yqrashawn/goku"

# === CLI Tools ===
brew "bat"
brew "chezmoi"
brew "cmake"
brew "cloudflared"
brew "docker", link: false
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "go"
brew "goku"
brew "helm"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lua"
brew "mas"
brew "mongosh"
brew "mysql", restart_service: :changed
brew "mysql-client"
brew "nnn"
brew "nowplaying-cli"
brew "opencv"
brew "openssh"
brew "platformio"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rbenv-gemset"
brew "redis"
brew "starship"
brew "switchaudio-osx"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"

# === Cask Applications ===
cask "nikitabobko/tap/aerospace"
cask "anydesk"
cask "arduino-ide"
cask "claude"
cask "claude-code"
cask "codex"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lens"
cask "logi-options+"
cask "mos"
cask "obsidian"
cask "postman"
cask "qflipper"
cask "raycast"
cask "sf-symbols"
cask "steam"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "viber"
cask "vlc"
cask "whatsapp"
cask "winbox"
cask "zoom"

# === Mac App Store ===
mas "keymapp", id: 6472865291
mas "Money Pro", id: 972572731
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
