# === Taps ===
tap "homebrew/bundle"
tap "homebrew/services"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "yqrashawn/goku"

# === CLI Tools ===
brew "atuin"
brew "bat"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-credential-helper"
brew "doctl"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "git-delta"
brew "go"
brew "goku"
brew "gron"
brew "hcloud"
brew "helm"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kubectl"
brew "kubectx"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lua"
brew "mas"
brew "mise"
brew "mkcert"
brew "mongosh"
brew "mycli"
brew "mysql", restart_service: :changed
brew "mysql-client"
brew "nnn"
brew "nowplaying-cli"
brew "opencv"
brew "openssh"
brew "pgcli"
brew "platformio"
brew "pnpm"
brew "postgresql@14"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rbenv-gemset"
brew "redis"
brew "restic"
brew "ripgrep"
brew "sd"
brew "sesh"
brew "starship"
brew "stern"
brew "switchaudio-osx"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "uv"
brew "watchexec"
brew "wget"
brew "xh"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"

# === Cask Applications ===
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "anydesk"
cask "arduino-ide"
cask "claude"
cask "claude-code"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lens"
cask "logi-options+"
cask "mos"
cask "obsidian"
cask "orbstack"
cask "qflipper"
cask "raycast"
cask "sf-symbols"
cask "steam"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "viber"
cask "vlc"
cask "whatsapp"
cask "winbox"
cask "zoom"

# === Mac App Store ===
mas "keymapp", id: 6472865291
mas "Money Pro", id: 972572731
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
